Repository: kugiigi/palitan-app
Catalog: po/*.po
Languages: nb

source: Menu
nb: Meny

source: Settings
nb: Innstillinger

source: About
nb: Om

source: Help
nb: Hjelp

source: Support
nb: Støtte

source: Report a bug
nb: Rapporter en feil

source: Contact Developer
nb: Kontakt utvikler

source: View source
nb: Vis kilde

source: Donate
nb: Doner

source: View in OpenStore
nb: Vis i OpenStore

source: Other apps by the developer
nb: Andre apper fra utvikler

source: Developers
nb: Utviklere

source: Main developer
nb: Hovedutvikler

source: Powered by
nb: Leveres av

source: Money formatting
nb: Valutaformattering

source: Exchange rates data: 1000 requests/month only
nb: Valutakursdata: 1000 forespørsler per måned

source: JSON models
nb: JSON modeller

source: Favorites
nb: Favoritter

source: Refresh data
nb: Oppfrisk data

source: Data successfully updated
nb: Data er oppdatert

source: Failed. Please try again.
nb: Mislyktes. Vennligst prøv igjen

source: Theme
nb: Tema

source: Home currency
nb: Din valuta

source: Alternate currency
nb: Alternativ valuta

source: Currency format
nb: Valuta format

source: None
nb: Ingen

source: Native
nb: Morsmål

source: Starting currencies
nb: Oppstartvalutaer

source: Restore from previous session
nb: Gjenopprett fra forrige sesjon

source: Home currency and Alternate Currency
nb: Din valuta og alternativ valuta

source: First and second in the list
nb: Første og andre i listen

source: Open external link
nb: Åpne ekstern link

source: You are about to open an external link. Do you wish to continue?
nb: Du er i ferd med å åpne en ekstern lenke. Ønsker du å fortsette?

source: Version
nb: Versjon

source: Released under license
nb: Utgitt på lisens

source: Reach Me!
nb: Nå meg!

source: Cool right?
nb: Kult, ikke sant?

source: Emirati Dirham
nb: Emiratarabisk Dirham

source: Afghanistan Afghani
nb: Afghansk Afghani

source: Albania Lek
nb: Albansk Lek

source: Armenian Dram
nb: Armenisk Dram

source: Netherlands Antilles Guilder
nb: Antilliansk gylden

source: Angolan Kwanza
nb: Angolsk kwanza

source: Argentina Peso
nb: Argentinsk peso

source: Australia Dollar
nb: Australsk dollar

source: Aruba Guilder
nb: Arubansk florin

source: Azerbaijan Manat
nb: Azerbajdsjansk manat

source: Bosnia and Herzegovina Convertible Marka
nb: Bosniske mark

source: Barbados Dollar
nb: Barbadisk dollar

source: Bangladeshi Taka
nb: Bangladeshisk taka

source: Bulgaria Lev
nb: Bulgarsk lev

source: Bahraini Dinar
nb: Bahrainsk dinar

source: Burundian Franc
nb: Burundisk franc

source: Bermuda Dollar
nb: Bermudisk dollar

source: Brunei Darussalam Dollar
nb: Bruneisk dollar

source: Bolivia Bolíviano
nb: Boliviansk boliviano

source: Brazil Real
nb: Brasiliansk real

source: Bahamas Dollar
nb: Bahamansk dollar

source: Bhutanese Ngultrum
nb: Bhutansk ngultrum

source: Botswana Pula
nb: Botswansk pula

source: Belarus Ruble
nb: Hviterussisk rubel

source: Belize Dollar
nb: Belizisk dollar

source: Canada Dollar
nb: Canadisk dollar

source: Congolese Franc
nb: Kongolesisk franc

source: Switzerland Franc
nb: Sveitsisk franc

source: Chilean Unidad de Fomento
nb: Chilensk Unidad de Fomento

source: Chile Peso
nb: Chilensk peso

source: China Yuan Renminbi (Offshore)
nb: Kinesisk renminbi (Offshore)

source: China Yuan Renminbi (Onshore)
nb: Kinesisk renminbi (Yuan)

source: Colombia Peso
nb: Columbiansk peso

source: Costa Rica Colon
nb: Costaricansk colon

source: Cuban Convertible Peso
nb: Cubansk konvertibel peso

source: Cuba Peso
nb: Cubansk peso

source: Cape Verdean Escudo
nb: Kappverdisk escudo

source: Czech Republic Koruna
nb: Tsjekkisk koruna

source: Djiboutian Franc
nb: Djiboutisk franc

source: Denmark Krone
nb: Dansk krone

source: Dominican Republic Peso
nb: Dominikansk peso

source: Algerian Dinar
nb: Algerisk dinar

source: Egypt Pound
nb: Egyptisk pund

source: Eritrean Nakfa
nb: Eritreisk nakfa

source: Ethiopian Birr
nb: Etiopisk birr

source: Euro Member Countries
nb: Euro

source: Fiji Dollar
nb: Fijansk dollar

source: Falkland Islands (Malvinas) Pound
nb: Falklandspund

source: United Kingdom Pound
nb: Britisk pund

source: Georgian Lari
nb: Georgisk lari

source: Guernsey Pound
nb: Guernsey-pund

source: Ghana Cedi
nb: Ghanesisk cedi

source: Gibraltar Pound
nb: Gibraltarsk pund

source: Gambian Dalasi
nb: Gambisk dalesi

source: Guinean Franc
nb: Guineansk franc

source: Guatemala Quetzal
nb: Guatemalansk quetzal

source: Guyana Dollar
nb: Guyansk dollar

source: Honduras Lempira
nb: Honduransk lempira

source: Croatia Kuna
nb: Kroatisk kune

source: Haitian Gourde
nb: Haitisk gourde (HTG)

source: Hungary Forint
nb: Ungarsk forint

source: Indonesia Rupiah
nb: Indonesisk rupiah

source: Israel Shekel
nb: Israelsk shekel

source: Isle of Man Pound
nb: Man-pund

source: India Rupee
nb: Indisk rupi

source: Iraqi Dinar
nb: Irakisk dinar

source: Iran Rial
nb: Iransk rial

source: Iceland Krona
nb: Islandsk krone

source: Jersey Pound
nb: Jersey-pund

source: Jamaica Dollar
nb: Jamaicansk dollar

source: Jordanian Dinar
nb: Jordansk dinar

source: Japan Yen
nb: Japansk yen

source: Kenyan Shilling
nb: Kenyansk shilling

source: Kyrgyzstan Som
nb: Kirgisisk som

source: Cambodia Riel
nb: Kambodsjansk riel

source: Comorian Franc
nb: Komorisk franc

source: Korea (North) Won
nb: Nordkoreansk won

source: Korea (South) Won
nb: Sørkoreansk won

source: Kuwaiti Dinar
nb: Kuwaitisk dinar

source: Cayman Islands Dollar
nb: Caymansk dollar

source: Kazakhstan Tenge
nb: Kasakhstansk tenge

source: Laos Kip
nb: Laotisk kip

source: Lebanon Pound
nb: Libanesisk pund

source: Sri Lanka Rupee
nb: Srilankisk rupi

source: Liberia Dollar
nb: Liberisk dollar

source: Basotho Loti
nb: Lesothisk loti

source: Libyan Dinar
nb: Libysk dinar

source: Moroccan Dirham
nb: Marokkansk dirham

source: Moldovan Leu
nb: Moldovsk leu

source: Malagasy Ariary
nb: Madagassisk ariary

source: Macedonia Denar
nb: Makedonsk denar

source: Burmese Kyat
nb: Myanmarsk kyat

source: Mongolia Tughrik
nb: Mongolsk tugrik

source: Macau Pataca
nb: Macaoisk pataca

source: Mauritanian Ouguiya
nb: Mauritisk ouguiya

source: Mauritius Rupee
nb: Mauritisk rupi

source: Maldivian Rufiyaa
nb: Maldivisk rufiyah

source: Malawian Kwacha
nb: Malawisk kwacha

source: Mexico Peso
nb: Meksikansk peso

source: Malaysia Ringgit
nb: Malaysisk ringgit

source: Mozambique Metical
nb: Mosambikisk metical

source: Namibia Dollar
nb: Namibisk dollar

source: Nigeria Naira
nb: Nigeriansk naira

source: Nicaragua Cordoba
nb: Nicaraguansk cordoba

source: Norway Krone
nb: Norsk krone

source: Nepal Rupee
nb: Nepalsk rupi

source: New Zealand Dollar
nb: Newzealandsk dollar

source: Oman Rial
nb: Omansk rial

source: Panama Balboa
nb: Panamansk balboa

source: Peru Sol
nb: Peruansk nuevo sol

source: Papua New Guinean Kina
nb: Papuansk kina

source: Philippines Peso
nb: Filippinsk peso

source: Pakistan Rupee
nb: Pakistansk rupi

source: Poland Zloty
nb: Polsk zloty

source: Paraguay Guarani
nb: Paraguayansk guarani

source: Qatar Riyal
nb: Qatarsk riyal

source: Romania Leu
nb: Rumensk leu

source: Serbia Dinar
nb: Serbisk dinar

source: Russia Ruble
nb: Russisk rubel

source: Rwandan Franc
nb: Rwandisk franc

source: Saudi Arabia Riyal
nb: Saudiarabisk riyal

source: Solomon Islands Dollar
nb: Salomonsk dollar

source: Seychelles Rupee
nb: Seychelliansk rupi

source: Sudanese Pound
nb: Sudansk pund

source: Sweden Krona
nb: Svensk krone

source: Singapore Dollar
nb: Singaporsk dollar

source: Saint Helena Pound
nb: Sankthelensk pund

source: Sierra Leonean Leone
nb: Sierraleonsk leone

source: Somalia Shilling
nb: Somalisk shilling

source: Suriname Dollar
nb: Surinamsk dollar

source: South Sudanese Pound
nb: Sørsudansk pund

source: Sao Tomean Dobra
nb: Saotomesisk dobra

source: El Salvador Colon
nb: Salvadoransk colon

source: Syria Pound
nb: Syrisk pund

source: Swazi Lilangeni
nb: Swazilandsk lilangeni

source: Thailand Baht
nb: Thailandsk bath

source: Tajikistani Somoni
nb: Tadsjikisk somoni

source: Turkmenistani Manat
nb: Turkmensk manat

source: Tunisian Dinar
nb: Tunisisk dinar

source: Tongan Pa'anga
nb: Tongansk paanga

source: Turkey Lira
nb: Tyrkisk lire

source: Trinidad and Tobago Dollar
nb: Trinidadisk dollar

source: Taiwan New Dollar
nb: Taiwansk dollar

source: Tanzanian Shilling
nb: Tanzaniansk shilling

source: Ukraine Hryvnia
nb: Ukrainsk hryvnia

source: Ugandan Shilling
nb: Ugandisk shilling

source: United States Dollar
nb: Amerikansk dollar

source: Uruguay Peso
nb: Uruguayansk peso

source: Uzbekistan Som
nb: Usbekisk sum

source: Venezuela Bolívar
nb: Venezuelansk bolivar fuerte

source: Venezuelan Bolívar
nb: Venezuelansk bolivar soberano

source: Viet Nam Dong
nb: Vietnamesisk dong

source: Ni-Vanuatu Vatu
nb: Vanuatisk vatu

source: Samoan Tala
nb: Samoansk tala

source: Central African CFA Franc BEAC
nb: CFA franc BEAC

source: Silver Ounce
nb: Sølv unse

source: Gold Ounce
nb: Gull unse

source: East Caribbean Dollar
nb: Østkaribisk dollar

source: Palladium Ounce
nb: Palladium unse

source: Platinum Ounce
nb: Platinum unse

source: Yemen Rial
nb: Jemenittisk rial

source: South Africa Rand
nb: Sørafrikansk rand

source: Zambian Kwacha
nb: Zambisk kwacha

source: Zimbabwe Dollar
nb: Zimbabwisk dollard

source: Ascending
nb: Stigende

source: Descending
nb: Synkende

source: Name
nb: Navn

source: Code
nb: Kode

source: Convert
nb: Konverter

source: Add to favorites
nb: Legg til i favoritter

source: Added to your favorites
nb: Lagt til i favoritter

source: Already in your favorites
nb: Allerede i dine favoritter

source: Swap
nb: Bytt

source: Copy result
nb: Kopier resultat

source: Trying to update data
nb: Forsøker å oppdatere data

source: Add
nb: Legg til

source: Sort
nb: Sorter

source: Default
nb: Standard

source: You don't have any favorites
nb: Du har ingen favoritter

source: Full View
nb: Full oversikt

source: Asc
nb: Stig

source: Desc
nb: Synk

source: Custom max precision
nb: Tilpasset maks presisjon

source: i.e.
nb: F.eks.

source: Previous
nb: Forrige

source: Next
nb: Neste

source: Last Updated
nb: Sist oppdatert

source: Source
nb: Kilde

source: Add new favorite
nb: Legg til ny favoritt

source: Unfavorite
nb: Fjern som favoritt

source: Deleted
nb: Slettet

source: Are you sure you want to remove this from your favorites?
nb: Er du sikker på at du vil fjerne dette fra favorittene dine?

source: By
nb: Av

source: Order
nb: Rekkefølge

source: No results
nb: Ingen resultater

source: Type in the input box to search
nb: Tast i inntastingsboksen for å søke

source: Cancel
nb: Avbryt

source: Palitan
nb: Valuta kalkulator
